Merging and Joining Data

In [4]:
import pandas as pd 

df_customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "name": ["Adam", "Bob", "Charlie", "David"]
})

df_orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "customer_id": [2, 1, 4, 5],
    "amount": [250, 120, 300, 180]
})

df_customers

   customer_id     name
0            1     Adam
1            2      Bob
2            3  Charlie
3            4    David

In [5]:
df_orders

   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

In [ ]:
# inner join - givin the matching rows from both the tables

pd.merge(df_customers,df_orders,on="customer_id")

   customer_id   name  order_id  amount
0            1   Adam       102     120
1            2    Bob       101     250
2            4  David       103     300

In [7]:
# Left join

pd.merge(df_customers,df_orders,on="customer_id",how="left")

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4    David     103.0   300.0

In [8]:
# right join

pd.merge(df_customers,df_orders,on="customer_id",how="right")

   customer_id   name  order_id  amount
0            2    Bob       101     250
1            1   Adam       102     120
2            4  David       103     300
3            5    NaN       104     180

In [9]:
# outer join

pd.merge(df_customers,df_orders,on="customer_id",how="outer")

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4    David     103.0   300.0
4            5      NaN     104.0   180.0

Data concatenation

Stacking DataFrame on top of each other(rows) or side by side (colms)

In [14]:
df1=pd.DataFrame({
    "id":[1,2,3],
    "name":["Charlii","parle","Kot"]
})

df2=pd.DataFrame({
    "id":[4,5,6],
    "name":["Kharlii","POp","Kowt"]
})

pd.concat([df1,df2]) # row wise
# overwite old labels
pd.concat([df1,df2], ignore_index=True)

#col wise
pd.concat([df1,df2], axis=1)

   id     name  id     name
0   1  Charlii   4  Kharlii
1   2    parle   5      POp
2   3      Kot   6     Kowt